// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Uppdatering av fast programvara";

// Errors
FileOpenError = "Kan inte öppna filen %@";
FileOpenErrorExplanation = "Denna fil är antingen korrumperad eller den kan ha flyttats till en annan plats, döpts om eller raderats. Kontrollera filens placering eller välj en annan fil och försök igen.";
PrintChannelOpenError = "Kan inte öppna en skrivarkanal";
PrintChannelOpenErrorExplanation = "Kontrollera att skrivaren är ansluten och påslagen. Försök igen.";
SendDataError = "Kan inte skicka data till skrivaren";
SendDataErrorExplanation = "Kontrollera att skrivaren är ansluten och påslagen. Försök igen.";

SomePenErrorTitle = "Kan inte uppdatera fast programvara";
DoorOpenMsg = "Kan inte uppdatera den fasta programvaran eftersom en lucka är öppen. Stäng alla luckor på skrivaren.";

// Aquamarine Errors
FileCheckError = "Kan inte uppdatera fast programvara";
FileCheckErrorExplanation = "Paketet för den fasta programvaran är inte giltigt. Välj en annan fil och försök igen.";

OkButton = "OK";
CancelButton = "Avbryt";
FirmwareUpdateTitle = "Uppdatering av fast programvara";
FirmwareUpdateDeviceState = "Skriver ut";
FirmwareUpdateCancelingDeviceState = "Avbryter";

// Great Wall Messages
PrinterIdleWarning = "Uppdateringen av den fasta programvaran kan misslyckas om skrivaren är upptagen (t.ex. utskrift eller kalibrering pågår).\n\nKontrollera att skrivaren är ledig innan du fortsätter med uppdateringen av den fasta programvaran.";
UpdateSuccessful = "Filen med den fasta programvaran har laddats upp och skrivaren kommer nu att uppdateras.\n\nNär uppdateringen av den fasta programvaran har slutförts kommer skrivaren att startas om automatiskt.";
InvalidPackage = "Det var problem med filen för den fasta programvaran och uppdateringen av den fasta programvaran lyckades inte. Problemet kan ha förorsakats av ett överföringsfel.\n\nFörsök att uppdatera den fasta programvaran igen.\nOm problemet fortsätter ska du kontakta HP Support.";
FailedDependencies = "Uppdateringen av den fasta programvaran kunde inte genomföras på grund av ett versionsproblem.\n\nDen aktuella versionen för den fasta programvaran är %@ och du försöker installera %@.\n\nBesök följande webbsida för att hitta rätt uppdateringspaket för denna skrivare:\n%@.";
NotNow = "Uppdateringen av den fasta programvaran har inte kunnat genomföras eftersom skrivaren är upptagen (bearbetar eller skriver ut en utskrift).\n\nKontrollera att skrivaren är ledig och utför uppdateringen av den fasta programvaran igen.";
TransmissionError = "Det var några problem med överföringen som innebar att uppdateringen av den fasta programvaran inte kunde genomföras på rätt sätt.\n\nKontrollera skrivaranslutningen och utför uppdateringen av den fasta programvaran igen.";
LicenseNotAccepted = "Den fasta programvaran har inte uppdaterats eftersom licensen inte accepterades.";
FatalError = "Det var problem som förhindrade att uppdateringen kunde genomföras på rätt sätt.\n\nOm problemet fortsätter ska du kontakta HP Support.";

// layout
TaskTitle = "Uppdatering av fast programvara";
TaskDescription = "Välj en fil som innehåller en uppdatering av fast programvara och överför denna fil till skrivaren för att uppdatera den.";
FileNameTitle = "Filnamn:";
FileNameField = "<Ej vald>";
ChooseButton = "Välj…";
UpdateButton = "Uppdatera";
ProgressPanel = "Uppdateringens förlopp";
FirmwareUpdateProcessTitle = "Uppdaterar…";
